
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7917038701)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 1 to change, 7 to destroy.</code></pre>

* Create
  * google_secret_manager_secret.frontend-sa-secret[&#34;base_endpoint&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;environment&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;firebase_api_key&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;firebase_app_id&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;firebase_auth_domain&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;firebase_messaging_sender_id&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;firebase_project_id&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;firebase_storage_bucket&#34;]
  * google_secret_manager_secret.frontend-sa-secret[&#34;user_auth&#34;]
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_firebase_project.ikigaikintore
  * google_identity_platform_config.firebase-auth-google
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase-auth
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_firebase_project.ikigaikintore will be destroyed
  # (because google_firebase_project.ikigaikintore is not in configuration)
  - resource "google_firebase_project" "ikigaikintore" {
      - display_name   = "ikigaikintore" -> null
      - id             = "projects/gig-japan-398904" -> null
      - project        = "gig-japan-398904" -> null
      - project_number = "139527520332" -> null
    }

  # google_identity_platform_config.firebase-auth-google will be destroyed
  # (because google_identity_platform_config.firebase-auth-google is not in configuration)
  - resource "google_identity_platform_config" "firebase-auth-google" {
      - authorized_domains         = [
          - "localhost",
          - "gig-japan-398904.firebaseapp.com",
          - "gig-japan-398904.web.app",
          - "ikigaipanelview-behoxqotna-an.a.run.app",
        ] -> null
      - autodelete_anonymous_users = true -> null
      - id                         = "projects/gig-japan-398904/config" -> null
      - name                       = "projects/139527520332/config" -> null
      - project                    = "gig-japan-398904" -> null

      - quota {
          - sign_up_quota_config {
              - quota          = 1 -> null
              - quota_duration = "86400s" -> null
              - start_time     = "2024-02-06T14:25:00Z" -> null
            }
        }

      - sign_in {
          - allow_duplicate_emails = false -> null
          - hash_config            = [
              - {
                  - algorithm      = "SCRYPT"
                  - memory_cost    = 14
                  - rounds         = 8
                  - salt_separator = "Bw=="
                  - signer_key     = "zgfWXNJlcPHyMghDLJbhD2ZUL4sB90JZ4g5WrDxlW1qzaH6MsWsze0aq1NYMAD33s8jtsV8NBQLoETTueRE4bw=="
                },
            ] -> null
        }

      - sms_region_config {
          - allowlist_only {
              - allowed_regions = [
                  - "JP",
                ] -> null
            }
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase-auth will be destroyed
  # (because google_project_service.firebase-auth is not in configuration)
  - resource "google_project_service" "firebase-auth" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/identitytoolkit.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "identitytoolkit.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_secret_manager_secret.frontend-sa-secret["base_endpoint"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "base_endpoint"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["environment"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "environment"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_api_key"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_api_key"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_app_id"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_app_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_auth_domain"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_auth_domain"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_messaging_sender_id"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_messaging_sender_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_project_id"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_project_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["firebase_storage_bucket"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "firebase_storage_bucket"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.frontend-sa-secret["user_auth"] will be created
  + resource "google_secret_manager_secret" "frontend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "user_auth"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 9 to add, 1 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":54,"Program":"tfcmt","SHA1":"7ded0eb8bb2958fcc334a1318ba3ba3716caca26","Vars":{},"WorkflowName":"iaac_plan"} -->